# Revisão

`ode` e `odeint`

# Satelite

In [1]:
from scipy.integrate import ode
import numpy as np

In [2]:
def f(t, w, args):
    M, G = args
    return [w[1],(-w[0]*M*G)/(w[0]**2 + w[2]**2)**(1.5),
           w[3],(-w[2]*M*G)/(w[0]**2 + w[2]**2)**(1.5)]

In [3]:
M = 600 # 6*10^(-24)
G = 1

In [5]:
t0 = 0
w0 = [0, -10, 10, -2]
args = [M, G]

In [6]:
r = ode(f)

In [7]:
r

In [8]:
r.set_integrator('lsoda')
r.set_initial_value(w0,t0)
r.set_f_params(args)

In [1]:
import plotly.graph_objects as go
fig = go.FigureWidget()

fig.add_scatter(x = [0], y=[0], mode = 'markers', marker_size = 30, name = "Terra")

fig.add_scatter(mode = 'lines', name = 'satelite')
fig

FigureWidget({
    'data': [{'marker': {'size': 30},
              'mode': 'markers',
              'name': 'T…

In [ ]:
dt = 0.1

w = w0.copy()

while r.successful():
    r.integrate(r.t + dt)
    w = np.vstack((w, r.y))
    fig.data[1].x = w[:,0]
    fig.data[1].y = w[:,2]

In [17]:
w

[0, -10, 10, -2]

In [18]:
r.y

array([-3.9302619 , -9.46861277,  8.70634542, -4.46867225])

## Pandas

!conda install pandas

In [2]:
import pandas as pd

In [15]:
d1 = {'nome': 'Sophia', 'idade': 5 , 'amigos': ['Julia', 'Heitor', 'Alice']}

In [4]:
d1

{'name': 'Sophia', 'idade': 5, 'amigos': ['Julia', 'Heitor', 'Alice']}

In [17]:
ser1 = pd.Series(d1)

In [6]:
ser1

name                      Sophia
idade                          5
amigos    [Julia, Heitor, Alice]
dtype: object

In [7]:
type(ser1)

pandas.core.series.Series

In [18]:
ser1['nome']

'Sophia'

In [9]:
d2 = {'nome': 'Julia', 'idade': 6, 'amigos': ['Sophia', 'Alice', 'Amanda']}
ser2 = pd.Series(d2)
d3 = {'nome': 'Heitor', 'idade': 5, 'amigos': ['Sophia', 'Daniel', 'Amanda', 'Rafael']}
ser3 = pd.Series(d3)

In [10]:
df = pd.DataFrame(data =[ser1, ser2, ser3])

In [36]:
d = [d1,d2,d3]
df = pd.DataFrame(d)

In [12]:
type(df)

pandas.core.frame.DataFrame

In [20]:
df

     nome  idade                            amigos
0  Sophia      5            [Julia, Heitor, Alice]
1   Julia      6           [Sophia, Alice, Amanda]
2  Heitor      5  [Sophia, Daniel, Amanda, Rafael]

In [22]:
df.head(2)

     nome  idade                   amigos
0  Sophia      5   [Julia, Heitor, Alice]
1   Julia      6  [Sophia, Alice, Amanda]

In [23]:
df.tail(1)

     nome  idade                            amigos
2  Heitor      5  [Sophia, Daniel, Amanda, Rafael]

In [24]:
df.nome

0    Sophia
1     Julia
2    Heitor
Name: nome, dtype: object

In [25]:
type(df.nome)

pandas.core.series.Series

In [26]:
df['nome']

0    Sophia
1     Julia
2    Heitor
Name: nome, dtype: object

In [27]:
df.iloc[0]

nome                      Sophia
idade                          5
amigos    [Julia, Heitor, Alice]
Name: 0, dtype: object

In [30]:
df['idade'] == 5

0     True
1    False
2     True
Name: idade, dtype: bool

In [31]:
df[df['idade'] == 5]

     nome  idade                            amigos
0  Sophia      5            [Julia, Heitor, Alice]
2  Heitor      5  [Sophia, Daniel, Amanda, Rafael]

In [33]:
df[[True, False, True]]

     nome  idade                            amigos
0  Sophia      5            [Julia, Heitor, Alice]
2  Heitor      5  [Sophia, Daniel, Amanda, Rafael]

In [37]:
df['nome'] == 'Heitor'

0    False
1    False
2     True
Name: nome, dtype: bool

In [38]:
df[df['nome'] == 'Heitor']

     nome  idade                            amigos
2  Heitor      5  [Sophia, Daniel, Amanda, Rafael]

In [39]:
df[df['nome'] == 'Heitor']['amigos']

2    [Sophia, Daniel, Amanda, Rafael]
Name: amigos, dtype: object

In [40]:
df.at[2,'amigos']

['Sophia', 'Daniel', 'Amanda', 'Rafael']

In [41]:
df.at[2,'amigos'].remove('Daniel')

In [42]:
df.head()

     nome  idade                    amigos
0  Sophia      5    [Julia, Heitor, Alice]
1   Julia      6   [Sophia, Alice, Amanda]
2  Heitor      5  [Sophia, Amanda, Rafael]